
{
  "title":"PS.2.2 Worked Example: Pushing Stacked Blocks",
  "content":"« Previous | Next »\nConsider two blocks that are resting one on top of the other. The lower block has mass \\(\\displaystyle m_1\\) and is resting on a surface. The upper block has mass \\(\\displaystyle m_2\u0026lt;m_1\\) . Suppose the coefficient of static friction between the blocks is \\(\\displaystyle \\mu _ s\\) . A horizontal force of magnitude \\(\\displaystyle F\\) is applied to block 1 as shhown.\nThe goal of this problem is to calculate the maximum value of \\(\\displaystyle F\\) with which the lower block can be pushed horizontally so that the two blocks move together without slipping?\n(Part a) Draw in separate figures the free force body diagrams for blocks 1 and 2. Identify the Newton\u0026rsquo;s 3rd Law pairs in the force diagrams.\n(Part b) Consider the coordinates system with the +x-axis horizontal and to the right and the +y axis vertically upwards. Write down the x and y components of Newton\u0026rsquo;s 2nd Law for each block.\nWorked Example - Stacked Blocks - Free Body Diagrams and Applying Newton\u0026rsquo;s 2nd Law Viewing videos requires an internet connection View video page Download video Download transcript (Part c) How is the acceleration of each of the two blocks related when the blocks do not slip relative to each other?\n(Part d) What is the maximum pushing force? Write your answer using some or all of the following: g, \\(\\displaystyle M_1\\), \\(\\displaystyle M_2\\),\\(\\displaystyle \\mu _ k\\) and \\(\\displaystyle \\mu _ s\\).\nWorked Example - Stacked Blocks - Solve for the Maximum Force Viewing videos requires an internet connection View video page Download video Download transcript (Part e) Why can\u0026rsquo;t we choose blocks 1 and 2 together to be our system?\nWorked Example - Stacked Blocks - Choosing the System of 2 Blocks Together Viewing videos requires an internet connection View video page Download video Download transcript « Previous | Next »\n"}


