
{
  "title":"Syllabus",
  "content":"[Learning]…There is nothing like having misunderstood something to really understand it, and there is nothing like having seriously misunderstood it to really, really understand it. —William Thomson\nCourse Meeting Times Lectures: 2 sessions / week, 1.5 hours / session\nRecitations: 1 session / week, 1 hour / session\nCourse Objective and Prerequisites To provide a solid foundation in probability and statistics for economists and other social scientists. We will emphasize topics needed in the further study of econometrics and provide basic preparation for 14.32 Econometrics. No prior preparation in probability and statistics is required, but familiarity with basic algebra and calculus is assumed.\nGrading and Requirements The course grade will be based on three non-cumulative exams and approximately nine problem sets.\nACTIVITIES PERCENTAGES Three non-cumulative exams 80% Approximately 9 problem sets 20% The exams will be closed book. The problem sets will typically be handed out on Tuesday and due the following Tuesday . You are expected to complete the problem sets on your own and without consulting old problem set solutions - it will clearly be in your interest to understand all of the material on them. Failing to return at least 7 problem sets will result in a maximum final letter grade of D. Regular attendance at the recitation is strongly recommended, as the TA will discuss problem sets, clarify lecture material, and provide other useful guidance.\n14.30 Policies Problem sets are designed to help you learn how to apply the material presented in lectures and recitations. You are permitted to discuss course material, including homework, with other students in the class. However, you must turn in your own individual solutions to each homework set. Discussion with others is intended to clarify ideas, concepts, and technical questions, not to derive group homework set solutions. Identical homework set answers (especially when the steps used to derive answers are not shown or when questions of interpretation are involved) violate this policy and will receive no credit. You are also expected to complete the problem sets without consulting old problem set solutions. Handwritten solutions are fine, as long as they are legible and neat. Please remember: if we can\u0026rsquo;t read it, we can\u0026rsquo;t grade it. In fairness to students who complete assignments on time, late homework sets will not be accepted. You may turn in assignments during the lecture on the day they are due. After the lecture, assignments may be placed in a designated box that will be set out outside our office until 4:30 pm . Do not leave assignments in the professor\u0026rsquo;s or TA\u0026rsquo;s office or mailbox. Taking all three exams is a requirement of the course. Missing an exam without a valid excuse will result in a failing grade for the entire course. To be considered valid, an excuse must be proffered prior to the exam that is to be missed; if at all possible, the excuse must be in writing, and it must be verifiable. These criteria are necessary, however, not sufficient. We reserve the right to deem an excuse meeting the above criteria invalid. An oral make-up exam will be given in the event of a valid excuse. All requests for regrades must be submitted in writing within 4 days of the exam being handed back. Note that the whole exam will be regraded. Cheating or academic dishonesty in any form will not be tolerated and will result in swift punitive action. This includes, but is not restricted to, copying information from other students\u0026rsquo; exams, communicating with other students during exams, failing to follow the rules of the exams regarding notes, calculators, etc., altering an exam for the purpose of a regrade, and producing fraudulent written excuses. Any student found to have cheated or behaved unethically or dishonestly will be given a grade of F on the exam involved and referred to the appropriate disciplinary committees within MIT for further action. Calendar WEEK # TOPICS KEY DATES 1 Set and Probability Theory 2 Random Variables, Probability Mass/Density Function, Cumulative Distribution Function (Univariate Model) Problem set 1 due 3 Multiple Random Variables, Bivariate Distribution, Marginal Distribution, Conditional Distribution, Independence, Multivariate Distribution (Multivariate Model) Problem set 2 due 4 Expectation (Moments) Problem set 3 due 5 Review for Exam 1 Exam 1 6 Random Variable and Random Vector Transformations (Univariate and Multivariate Models) Problem set 4 due 7 Special Distributions (Discrete and Continuous) Problem set 5 due\nMidterm Evaluation\n8 Review for Exam 2 Exam 2 9 Random Sample, Law of Large Numbers, Central Limit Theorem Problem set 6 due 10 Point Estimators and Point Estimation Methods Problem set 7 due 11 Interval Estimation and Confidence Intervals Problem set 8 due 12 Hypothesis Testing Problem set 9 due 13 Review for Exam 3 Exam 3 "}


