
{
  "title":"37.4 Summary of Angular Momentum and Kinetic Energy",
  "content":"« Previous | Next »\nFixed Axis Rotation vs. Translation and Rotation\nHere we contrast the expressions of the angular momentum and kinetic energy for a rigid object rotating about a fixed axis vs. a rigid object translating and rotating. For the case of fixed axis rotation, the object is pivoted about point S, left figure. Both rods are identical, length \\(d\\), mass \\(m\\), moment of inertia about an axis passing through the center of mass \\(I_{cm}\\), and about an axis passing through point \\(S\\) is \\(I_S\\). The plane of rotation is contained in he plane of the screen. The position vector of the center of mass measured with respect to \\(S\\) is \\(\\vec{r}_{cm}\\).\nAngular Momentum\n\\(\\vec{L}_S = I_S\\vec{\\omega}\\)\nKinetic Energy\n\\(\\displaystyle K = \\frac{1}{2}\\;I_S\\omega^2\\)\nAngular Momentum\n\\(\\vec{L}_S = \\vec{r}_s \\times m\\vec{v}_{cm} + I_{cm}\\vec{\\omega}\\)\nKinetic Energy\n\\(\\displaystyle K = \\frac{1}{2}mv_{cm}^2+\\frac{1}{2}\\;I_{cm}\\omega^2\\)\nNote:\nIn previous questions you have shown that if an object rotates about a fixed axis passing through point \\(S\\) and perpendicular to the plane of rotation, the angular momentum about point \\(S\\) is also given by: \\(\\vec{L}_S = m\\vec{r}_{cm} \\times \\vec{v}_{cm} + I_{cm} \\vec{\\omega} \\)\nThis is true because the center of mass is moving in a circle of radius \\(d/2\\) with center at point \\(S\\) and with the same \\(\\vec{\\omega}\\) as the object. As a result, the velocity of the center of mass has a magnitude \\(\\omega d/2\\) therefore \\(\\vec{L}_S\\) becomes \\(\\vec{L}_S = m\\frac{d^2}{4} \\vec{\\omega} + I_{cm} \\vec{\\omega}\\). Using the parallel axis theorem \\(\\vec{L}_S = I_S\\vec{\\omega}\\).\nYou also showed that the kinetic energy for the object rotating about a fixed axis passing through point \\(S\\) is expressed as \\(\\displaystyle K = \\frac{1}{2}mv_{cm}^2+\\frac{1}{2}\\;I_{cm}\\omega^2\\).\nFor the same reason as before, this is true because the speed of the center of mass is \\(\\omega d/2\\) and the parallel axis theorem.\nTo avoid confusion, we advise you to always write \\(\\vec{L}_S = I_S\\vec{\\omega}\\) and \\(K = \\frac{1}{2}I_S\\omega^2\\) for the case of fixed axis rotation.\n« Previous | Next »\n"}


