
{
  "title":"About the Team",
  "content":"« Previous | Next »\nDeepto Chakrabarty Deepto Chakrabarty is Professor of Physics and Astrophysics Division Head in the Physics Department at MIT. He received an S.B. in Physics at MIT in 1988 and a Ph.D. in Physics at Caltech in 1996. Chakrabarty joined the MIT faculty in 1999 and has taught classes in Classical Mechanics, Electricity and Magnetism, Vibrations and Waves, Quantum Mechanics, and Astrophysics. His research specialty is in high-energy astrophysics and the physics and astrophysics of neutron stars, and he is the author of over 100 research papers. Chakrabarty was awarded the Buechner Teaching Prize in Physics from MIT in 2001 and the Bruno Rossi Prize in High Energy Astrophysics by the American Astronomical Society in 2006. He was elected a Fellow of the American Physical Society in 2011.\nSaif Rayyan Saif Rayyan is a lecturer in the Physics Department at MIT. He received his Ph.D. in theoretical particle physics from Virginia Tech before switching his interests to teaching and to physics education research. In addition to teaching introductory physics, Saif is working on the development of physics courses on edX.\nPeter Dourmashkin Peter Dourmashkin is Senior Lecturer in the Department of Physics at MIT. His research interests are in Mathematical Physics, Lie Group and Algebra Representation Theory. He has been part of the development, implementation, and teaching team for Technology Enabled Active Learning (TEAL). He has developed OCW Scholar Courses, the physics curriculum for the Singapore University of Technology and Design (SUTD), and is currently working on online learning through MITx and edX.\nAnalia Barrantes Analia Barrantes is a Physics Lecturer at the Experimental Study Group at MIT and is working in the development of pedagogical content for the freshmen physics courses on edX. Analia holds a master’s in physics from the University of Buenos Aires and a Ph.D. in civil and environmental engineering from MIT.\nMichelle Tomasik Michelle Tomasik is a postdoc in the Department of Physics at MIT where she currently works on developing online classes and assists with physics education research and teaching introductory physics. She received her Ph.D. in physics from MIT working on photovoltaics and density functional theory.\nGeorge Stephans George Stephans (PhD U Pennsylvania) is a Senior Research Scientist in the Laboratory for Nuclear Science and a Senior Lecturer in the Physics Department at MIT. His research work involves collisions of very high energy atomic nuclei. The goal of these studies is to understand the behavior of systems of sub-atomic constituents (quarks and gluons) at extremely high temperatures and densities. His most recent experiments use the CMS detector at the Large Hadron Collider at CERN. He has decades of experience teaching physics at MIT.\nAnna Frebel Anna Frebel is the Silverman (\u0026lsquo;68) Family Career Development Professor and Assistant Professor in the Astrophysics Division of the Physics Department at MIT. Originally from Germany, she received her PhD from the Australian National University\u0026rsquo;s Mt. Stromlo Observatory. Frebel joined the MIT physics faculty in 2012. She has taught Astrophysics and Classical Mechanics, and mentors research students. Her research focuses on the oldest stars in the universe and the early evolution of the chemical elements. Frebel also enjoys communicating science to the public, lately through her popular science book \u0026ldquo;Searching for the oldest stars: Ancient Relics from the Early Universe\u0026rdquo;.\n« Previous | Next »\n"}


