
{
  "title":"Syllabus",
  "content":" Course Meeting Times 2 sessions per week / 1.5 hours per session\nPrerequisites 18.100 Analysis; and one of 18.06 Linear Algebra, 18.700 Linear Algebra, or 18.701 Algebra I.\nCourse Description The two primary goals of many pure and applied scientific disciplines can be summarized as follows:\nFormulate/devise a collection of mathematical laws (i.e., equations) that model the phenomena of interest. Analyze solutions to these equations in order to extract information and make predictions. The end result of i) is often a system of partial differential equations (PDEs). Thus, ii) often entails the analysis of a system of PDEs. This course will provide an application-motivated introduction to some fundamental aspects of both i) and ii).\nIn order to provide a broad overview of PDEs, our introduction to i) will touch upon a diverse array of equations including\nThe Laplace and Poisson equations of electrostatics; The diffusion equation, which models e.g. the spreading out of heat energy and chemical diffusion processes; The Schrödinger equation, which governs the evolution of quantum-mechanical wave functions; The wave equation, which models e.g. the propagation of sound waves in the linear acoustical approximation; The Maxwell equations of electrodynamics; and other topics as time permits. In our introduction to ii), we will study three important classes of PDEs that differ markedly in their quantitative and qualitative properties: elliptic, diffusive, and hyperbolic. In each case, we will discuss some fundamental analytical tools that will allow us to probe the nature of the corresponding solutions.\nRequired Text Salsa, Sandro. Partial Differential Equations in Action: From Modelling to Theory. Springer, 2010. ISBN: 9788847007512. [Preview with Google Books]\nHomework Assignments Homework is perhaps the most important component of this course: it provides you with regular feedback on whether or not you are keeping up with the material, and it challenges you to creatively apply what you have already learned. There will be an assignment almost every week. Homework assignments will typically be posted on the course website on Thursday and due at the start of class on the following Thursday. No late assignments will be accepted. Your lowest homework score will not factor into your grade. For your own benefit, I encourage you to learn how to use the typesetting program LaTeX to type up your homework. However, you can turn in neatly handwritten assignments if you prefer. Your homework will be graded both on correctness and on the quality of your written arguments.\nPolicy on collaboration: Collaboration is an important component of your mathematical and personal development, and I encourage you to work with your classmates. By \u0026ldquo;work with,\u0026rdquo; I mean that every member of a collaborative effort is expected to be an active contributor. The version of the homework that you turn in must be written in your own words and your own writing style, and you must fully understand the written arguments; copying someone else\u0026rsquo;s homework line by line is plagiarism. Also, at the top of every homework assignment in which you collaborate, write the names of the people you worked with.\nPolicy on citations: It is natural to consult resources when you get stuck on a problem. If you use a resource (e.g. Wikipedia, a textbook, a journal article, etc.), you must cite it using one of the standard citation styles. Indicate the title, author, volume number, year, and page number (or web address if appropriate) of your references.\nExams There will be a single 90 minute midterm exam held in class. There will be no homework due that week. Both the midterm and the final will be closed book, closed notes. The final exam will be cumulative with a slight emphasis on the material covered after the midterm.\nGrading The breakdown of your final grade is as follows:\nACTIVITIES PERCENTAGES Homework 30 % Midterm Exam 30 % Final Exam 40 % "}


