
{
  "title":"PS.2.3 Window Washer Problem",
  "content":"« Previous | Next »\nA window washer of mass \\(\\displaystyle m\\) is sitting on a horizontal platform of negligible mass. The platform is held up by the two pulleys and the two ropes (A and B) shown in the figure. The person is able to pull Rope B downwards in such a way that the platform accelerates upwards with an acceleration of magnitude \\(\\displaystyle a\\). Assume the ropes and pulleys to be massless. The goal of the problem is to calculate the force exerted by the window washer on rope B in terms of \\(\\displaystyle a\\), \\(\\displaystyle m\\) and \\(\\displaystyle g\\) as needed.\n(Part a) Let \\(\\displaystyle F_{wB}\\) be the magnitude of the force exerted by the window washer on rope B, and \\(\\displaystyle F_{Bw}\\) be the magnitude of the force exerted by rope B on the window washer. Which of the following statements are true? (Check all that apply.)\nThe total force acting on the window washer is pointing upwards. The window washer pulls rope B down and rope B pulls the window washer up. \\(\\displaystyle F_{wB} = F_{Bw}\\) because they are the magnitude of a Newton 3rd law pair. \\(\\displaystyle F_{Bw} = ma\\) The force of tension at any point in rope B has the same magnitude. (Part b) Consider the system to be the window washer. Draw the force free body diagram of the window washer, count the forces acting on the person. Is there enough information to solve for each of the forces?\n(Part c) In order to calculate \\(\\displaystyle F_{wB}\\), the magnitude of the force exerted by the window washer on rope B, which of the following set of objects should be considered as the system to study?\nPulley 1. Pulley 2. Pulley 1 and pulley 2. The window washer and the platform The window washer, the platform, rope A and pulley 1. Window Washer Free Body Diagrams Viewing videos requires an internet connection View video page Download video Download transcript Now that we know the system, we can solve for \\(\\displaystyle F_{wB}\\).\n(Part d) What is the magnitude of the force exerted by the person on rope B, \\(\\displaystyle F_{wB}\\)? Express your answer in terms of \\(\\displaystyle a\\), \\(\\displaystyle m\\) and \\(\\displaystyle g\\) as needed.\n(Part e) What is the magnitude of the force exerted by rope A on the platform, \\(\\displaystyle F_{Ap}\\)? Express your answer in terms of \\(\\displaystyle a\\), \\(\\displaystyle m\\) and \\(\\displaystyle g\\) as needed.\nWindow Washer Solution Viewing videos requires an internet connection View video page Download video Download transcript « Previous | Next »\n"}


