
{
  "title":"PS.1.5 Worked Example: Pedestrian and Bike at Intersection",
  "content":"« Previous | Next »\nYou are in a car standing by a traffic light and at time \\(\\displaystyle t=0 \\) the light turns green. You start to accelerate during the first \\(\\displaystyle t_1 \\) seconds so that the acceleration of your car is given by:\n\\(\\displaystyle a_1(t) = \\left\\{ \\begin{array}{ll} b_1 \u0026amp; \\quad 0 \\leq t \\leq t_1 \\\\ 0 \u0026amp; \\quad t_1 \u0026lt; t \\leq t_2 \\end{array} \\right. \\) where \\(\\displaystyle b_1 \\) is a positive constant.\nAt the instant the light turns green a cyclist passes through the intersection moving with a speed \\(\\displaystyle v_0 \\) in the same direction as your car is moving. At that instant, the cyclist starts to brake with a constant acceleration of magnitude \\(\\displaystyle b_2 \\). At time \\(\\displaystyle t = t_2 \\) the cyclist stops at the same location where you are.\nThe goal of the problem is to calculate the value of \\(\\displaystyle b_2 \\) in terms of the given variables, \\(\\displaystyle b_1 \\), \\(\\displaystyle v_0 \\), \\(\\displaystyle t_1 \\) and \\(\\displaystyle t_2 \\).\nFirst: Describe the motion of the car. Given the car\u0026rsquo;s acceleration \\(\\displaystyle a_1(t) \\), find its velocity and its position as a function of time:\n(Part b) Calculate \\(\\displaystyle x_1(t) \\) , the car\u0026rsquo;s position as a funcion of time. Express your answer in terms of \\(\\displaystyle t \\), \\(\\displaystyle t_1 \\), and \\(\\displaystyle b_1 \\) as needed.\nSecond: Describe the motion of the bicycle. Given the bicycle\u0026rsquo;s acceleration \\(\\displaystyle a_2(t) \\), find its velocity and its position:\n(Part c) Calculate \\(\\displaystyle v_2(t) \\) , the bicycle\u0026rsquo;s velocity as a funcion of time. Express your answer in terms of \\(\\displaystyle t \\), \\(\\displaystyle b_2 \\), \\(\\displaystyle v_0 \\) as needed.\n(Part d) Calculate \\(\\displaystyle x_2(t) \\) , the bicycle\u0026rsquo;s position as a funcion of time. Express your answer in terms of \\(\\displaystyle t \\),\\(\\displaystyle b_2 \\), and \\(\\displaystyle v_0 \\) as needed.\nThird: Find the value of \\(\\displaystyle b_2 \\). We know that the bicycle stops at \\(\\displaystyle t=t_2 \\), this condition is expressed as:\n\\(\\displaystyle v_2(t_2) = 0 \\) (eq. 1)\nWe also know that the bicycle and the car are at the same location when the bicycle stops. This condition implies:\n\\(\\displaystyle x_2(t_2) = x_1(t_2) \\) (eq. 2)\nUse (eq.1) and (eq. 2) to obtain the value of \\(\\displaystyle b_2 \\). Express your answer in terms of \\(\\displaystyle t_1 \\), \\(\\displaystyle b_1 \\), and \\(\\displaystyle v_0 \\). Do not use \\(\\displaystyle t_2 \\) in your answer.\nViewing videos requires an internet connection View video page Download video Download transcript « Previous | Next »\n"}


