
{
  "title":"Syllabus",
  "content":"Next »\nVideo Introduction by Prof. Deepto Chakrabarty and Dr. Peter Dourmashkin Classical Mechanics Course Introduction Viewing videos requires an internet connection View video page Download video Download transcript Course Meeting Times Lectures: 2 sessions / week, 2 hours / session\nProblem Solving: 1 session / week, 1 hour / session\nPrerequisites This course has no prerequisites. 18.01SC Single Variable Calculus is a corequisite.\nCourse Overview This first course in the physics curriculum introduces classical mechanics. Historically, a set of core concepts — space, time, mass, force, momentum, torque, and angular momentum — were introduced in classical mechanics in order to solve the most famous physics problem, the motion of the planets.\nThe principles of mechanics successfully described many other phenomena encountered in the world. Conservation laws involving energy, momentum and angular momentum provided a second parallel approach to solving many of the same problems. In this course, we will investigate both approaches: Force and conservation laws.\nOur goal is to develop a conceptual understanding of the core concepts, a familiarity with the experimental verification of our theoretical laws, and an ability to apply the theoretical framework to describe and predict the motions of bodies.\nTextbook The textbook for this course is Classical Mechanics: MIT 8.01 Course Notes by Peter Dourmashkin. Specific readings for each assignment are provided in the Readings section.\nTopics Covered Week 1: Kinematics Week 2: Newton\u0026rsquo;s Laws Circular Motion Week 3: Circular Motion Momentum and Impulse Week 4: Drag Forces, Constraints and Continuous Systems Work and Mechanical Energy Week 5: Momentum and Impulse Collision Theory Week 6: Continuous Mass Transfer Torque Week 7: Kinetic Energy and Work Week 8: Potential Energy and Energy Conservation Week 9: Collision Theory Week 10: Rotational Motion Week 11: Angular Momentum Week 12: Rotations and Translation - Rolling How to Use This Site This version of 8.01 Classical Mechanics on OCW is modified from the materials presented in the fall 2016 course taught at MIT. The course is broken into twelve weeks, as listed above. Each week contains 3-4 lessons on distinct topics. Each lesson consists of a series of videos explaining the topic, which are meant to be viewed in sequence.\nThe first lesson is on vectors; the \u0026ldquo;Previous\u0026rdquo; and \u0026ldquo;Next\u0026rdquo; buttons can be used to navigate between videos. Alternatively, all videos can be accessed on the \u0026ldquo;Week\u0026rdquo; page corresponding to that lesson.\nGrades This subject is pass / no record for first-year students.\nactivities percentages 3 Midterm Exams 45% Final Exam 25% Problem Sets 10% Class Participation 20% Problem Sets Almost every week a problem set will be due. This homework will typically consist of five or six problems. To receive full credit for the written component of your homework, you must prepare and submit lucid and clearly reasoned written solutions. A selection of these problems will be graded and returned.\nTip for success Work more frequently. Do your homework in frequent, small pieces. Do a few problems one night, a few problems on another. This ensures that any insights you have will stay in your brain, helping you understand and remember things better in the long run.\nGroup Work Scientists and engineers work in groups as well as alone. Social interactions are critical to their success. Most good ideas grow out of discussions with colleagues. This subject encourages collaborative teamwork. As you study together, help your partners, ask each other questions, and critique your group homework and lab write-ups. Teach each other! You can learn a great deal by teaching others.\nYou will form groups of three for collaborative work. If you are not satisfied with the way your group is working, first try to discuss it with your group members. If you cannot arrive at a satisfactory solution, then discuss the problems with your instructor.\nNext »\n"}


