
{
  "title":"About the Videos",
  "content":" Description The goal of these videos is to provide students with tools and concepts for working with R, a free software environment for statistical computing and graphics. The students will learn the basics of R, how to navigate the R interface and deal with different data formats, how to run and interpret linear models with R, and how to use Geographic Information Systems (GIS) in R. These practical sessions were developed as part of the course 1.845 Terrestrial Carbon Cycle and Ecosystem Ecology but will be useful for anyone looking to learn about R and GIS.\nPrior Knowledge The sessions are designed for students who are interested in earth systems and environmental sciences and are willing to acquire basic skills and good practices for facing, analyzing, and interpreting data. No previous knowledge in programming is required.\nContents Introduction to R Part I: Interface and Data Structure Part II: Playing with the Data Part III: Linear and Mixed Models in R Part IV: Loops and Functions Introduction to Geographic Information Systems (GIS) Part I: Key Concepts Part II: Vectorial Maps, Raster Maps, and Time Series Part III: Projection Part IV: Stack, Brick, Crop, and Mask Part V: Extract Information from Maps using Spatial Data Points Part VI: Plotting Maps with ggplot2\nGoals After attending the sessions, the students are expected to be able to do the following:\nIntroduction to R Describe what R is and what its characteristics are, the different types of data and data structures. Be able to use R to load and store data and use basic functions such as “subset,” “unique,” ”hist,” ”colnames,” ”order,” or ”cbind.” Create and interpret basic linear models and linear mixed models. Formulate simple loops and functions and be familiar with good practices to maintain a tidy workflow. Introduction to GIS Explain the differences between raster and vectorial maps, as well as the importance of the resolution and projection concepts. Use R to read and visualize raster and vectorial maps and to change projections and resolution. Use R to create stacks, crop, mask, and make calculations with maps. Gap-fill data based on information extracted from maps. Plot maps using ggplot2. "}


