
{
  "title":"Readings",
  "content":"This section includes assigned readings from the three main texts used in the course.\nRequired Text [ROS]: Ross, Sheldon M. Probability and Statistics for Engineers and Scientists. 3rd ed. San Diego, CA: Academic Press, 2004. ISBN: 0125980574.\nRecommended Texts [LM]: Larsen, Richard J., and Morris L. Marx. An Introduction to Mathematical Statistics and its Applications. 3rd ed. Upper Saddle River, NJ: Prentice Hall, 2001. ISBN: 0139223037.\n[DS]: DeGroot, Morris H., and Mark J. Schervish. Probability and Statistics. 3rd ed. Boston, MA: Addison-Wesley, 2002.\nLarsen and Marx\u0026rsquo;s book is a bit more chatty than Ross\u0026rsquo;, while DeGroot and Schervish\u0026rsquo;s is a very good book but somewhat more difficult. You can find additional resources in the related resources section.\nAssigned Readings Readings are from Ross [ROS], Larsen and Marx [LM], and DeGroot and Schervish [DS]. Note that ROS does not cover all the topics but more closely follows the material taught in class.\nWEEK # TOPICS ROS LM DS 1 Set and Probability Theory Chapter 3 Chapters 1.1–1.3, 2.1–2.10 Chapters 1, 2.1–2.3 2 Random Variables, Probability Mass/Density Function, Cumulative Distribution Function (Univariate Model) Chapters 4.1–4.2, 5.1, pp. 160-1 Chapter 3.1–3.4 Chapter 3.1–3.3 3 Multiple Random Variables, Bivariate Distribution, Marginal Distribution, Conditional Distribution, Independence, Multivariate Distribution (Multivariate Model) Chapter 4.3 Chapter 3.5–3.6, 3.9 Chapter 3.4–3.7 4 Expectation (Moments) Chapter 4.4–4.9 Chapter 3.10–3.13, 3.15–3.16 Chapter 4.1–4.7 5 Review for Exam 1 6 Random Variable and Random Vector Transformations (Univariate and Multivariate Models) Chapter 3.7 Chapter 3.8–3.9 7 Special Distributions (Discrete and Continuous) Chapter 5.1–5.8 Chapters 3.3, 4.1–4.3, 4.5–4.6 Chapter 5.1–5.6, 5.9 8 Review for Exam 2 9 Random Sample, Law of Large Numbers, Central Limit Theorem Chapters 6, 4.9, 1, 2 Chapters 3.14, pp. 272-5, 5.1, 5.4 Chapters 4.8, 5.7, 7.1, 7.7 10 Point Estimators and Point Estimation Methods Chapter 7.7 and 7.1–7.2 Chapter 5.2 Chapter 6.5–6.6 11 Interval Estimation and Confidence Intervals Chapters 7.3–7.6, 5.8.2–5.8.3 Chapter 5.3 Chapter 7.5 12 Hypothesis Testing Chapter 8 Chapters 6, 9.1–9.2 Chapter 8 13 Review for Exam 3 Advanced topics, time permitting: Bayesian Analysis and Nonparamatric Methods.\n"}


