
{
  "title":"Readings and Assignments",
  "content":" Textbook All readings and problem assignments are from the textbook:\nMattuck, Arthur. Introduction to Analysis. Pearson, 1998. ISBN: 9780130811325.\nPreface (PDF)\nTable of Contents (PDF)\nSample Sections (PDF)\nTextbook Corrections\nKey to the Readings Chapter 1.1–1.3, Appendix A means:\nRead: Chapter 1, sections 1, 2, 3, and Appendix A (in the back of the book).\nKey to the Assignments Note: There are three types of problems in the book; don\u0026rsquo;t confuse Questions with exercises and end up doing the wrong problem!\nQuestions Q1.3/2: Question 2 in section 1.3. These occur at the end of each section: they are short, easy, meant to test the ideas, and have answers at the end of the chapter. Use the answers only to confirm your own, or just for a quick glance and hint.\nExercises 1.3/2: Exercise 2 at the end of Chapter 1, tied to section 1.3. These are tied to a given section and use the techniques explained in that section; look through that section for ideas or similar examples.\nProblems P1–3: Problem 1–3, the third problem at the end of Chapter 1. These are at the end of the chapter–anything in the chapter might be relevant to solving them.\nNotes on the table below: The daily reading assignments (see column 3) depended on what the class had been able to cover that day, so they differed a little in order and content from the overall plan laid out in the \u0026ldquo;topics\u0026rdquo; column.\nSES # TOPICS READINGS AND ASSIGNMENTS 1 Monotone sequences; completeness; inequalities 2 Estimations; limit of a sequence Assignment 1 readings and problems (PDF) 3 Examples of limits Assignment 2 readings and problems (PDF) 4 Error term; limit theorems 5 Subsequences, cluster points Assignment 3 readings and problems (PDF) 6 Nested intervals, Bolzano-Weierstrass theorem, Cauchy sequences Assignment 4 readings and problems (PDF) 7 Completeness property for sets 8 Infinite series Assignment 5 readings and problems (PDF) 9 Infinite series (cont.) 10 Power series Assignment 6 readings and problems (PDF) 11 Functions; local and global properties Assignment 7 readings and problems (PDF) 12 Exam 1 (open book) 13 Continuity Assignment 8 readings and problems (PDF) 14 Continuity (cont.) Assignment 9 readings and problems (PDF) 15 Intermediate-value theorem Assignment 10 readings and problems (PDF) 16 Continuity theorems Assignment 11 readings and problems (PDF) 17 Uniform continuity 18 Differentiation: local properties Assignment 12 readings and problems (PDF) 19 Differentiation: global properties Assignment 13 readings and problems (PDF) 20 Convexity; Taylor\u0026rsquo;s theorem (skip proofs) 21 Integrability Assignment 14 readings and problems (PDF) 22 Riemann integral Assignment 15 readings and problems (PDF) 23 Fundamental theorems of calculus 24 Improper integrals, convergence, Gamma function Assignment 16 readings and problems (PDF) 25 Stirling\u0026rsquo;s formula; conditional convergence Assignment 17 readings and problems (PDF) 26 Exam 2 (open book) 27 Uniform convergence of series 28 Continuity of sum; integration term-by-term Assignment 18 readings and problems (PDF) 29 Differentiation term-by-term; analyticity Assignment 19 readings and problems (PDF) 30 Continuous functions on the plane Assignment 20 readings and problems (PDF) 31 Quantifiers and Negation Assignment 21 readings and problems (PDF) 32 Plane point-set topology Assignment 22 readings and problems (PDF) 33 Compact sets and open sets 34 Differentiating integrals with respect to a parameter Assignment 23 readings and problems (PDF) 35 Leibniz and Fubini theorems Assignment 24 readings and problems (PDF) 36 Improper integrals with a parameter 37 Differentiating and integrating improper integrals Assignment 25 readings and problems (PDF) 38 Countability; sets of measure zero 39 Introduction to Lebesgue integral; review Assignment 26 readings and problems (PDF) 40 Three-hour final exam during finals week (open book) "}


