
{
  "title":"Readings",
  "content":" Lec # Topics READINGS 1 From Spikes to Rates Koch, Christof. Biophysics of Computation: Information Processing in Single Neurons. New York, NY: Oxford University Press, 2004, section 14.2, pp. 335-341. ISBN: 9780195181999.\nErmentrout, Bard. \u0026ldquo;Reduction of Conductance-Based Models with Slow Synapses to Neural Nets.\u0026rdquo; Neural Computation 6, no. 4 (July 1994): 679-695. 2 Perceptrons: Simple and Multilayer 3 Perceptrons as Models of Vision Marr, David. Vision: A Computational Investigation into the Human Representation and Processing of Visual Information. New York, NY: W.H. Freeman \u0026amp; Company, 1983, section 2.2, pp. 54-79. ISBN: 9780716715672.\nHubel, David H. Eye, Brain, and Vision. New York, NY: W.H. Freeman \u0026amp; Company, 1988, chapter 3, pp. 39-46. ISBN: 9780716750208.\nLeNet Web site 4 Linear Networks 5 Retina Adelson, E. H. \u0026ldquo;Lightness Perception and Lightness Illusions.\u0026rdquo; The New Cognitive Neurosciences. Edited by Michael S. Gazzaniga. 2nd ed. Cambridge, MA: MIT Press, 1999, pp. 339-351. ISBN: 9780262071956.\nHartline, H. K., and F. Ratliff. \u0026ldquo;Inhibitory Interaction in the Retina of Limulus.\u0026rdquo; Physiology of Photoreceptor Organs. Edited by Michelangelo G. F. Fuortes. New York, NY: Springer-Verlag, 1972, pp. 382-447. ISBN: 9780387057439. 6 Lateral Inhibition and Feature Selectivity Press, William H., Saul A. Teukolsky, William T. Vetterling, and Brian P. Flannery. Numerical Recipes in C: The Art of Scientific Computing_._ New York, NY: Cambridge University Press, 1992, chapters 12, and 13. ISBN: 9780521431088.\nStrang, Gilbert. Introduction to Applied Mathematics. Wellesley, MA: Wellesley-Cambridge Press, 1986, section 4.2, pp. 290-309. ISBN: 9780961408800. 7 Objectives and Optimization 8 Hybrid Analog-Digital Computation\nRing Network Hahnloser, R. H., R. Sarpeshkar, M. A. Mahowald, R. J. Douglas, and H. S. Seung. \u0026ldquo;Digital selection and analog amplification coexist in a cortex-inspired silicon circuit.\u0026rdquo; Nature 405, no. 6789 (June 22, 2000): 947-51.\nHahnloser, Richard H., H. Sebastian Seung, and Jean-Jacques Slotine. \u0026ldquo;Permitted and Forbidden Sets in Symmetric Threshold-Linear Networks.\u0026rdquo; Neural Computation 15, no. 3 (March 2003): 621-38. 9 Constraint Satisfaction\nStereopsis 10 Bidirectional Perception 11 Signal Reconstruction 12 Hamiltonian Dynamics Midterm 13 Antisymmetric Networks 14 Excitatory-Inhibitory Networks\nLearning 15 Associative Memory 16 Models of Delay Activity\nIntegrators 17 Multistability\nClustering 18 VQ\nPCA 19 More PCA\nDelta Rule 20 Conditioning\nBackpropagation 21 More Backpropagation 22 Stochastic Gradient Descent 23 Reinforcement Learning 24 More Reinforcement Learning 25 Final Review "}


