
{
  "title":"Syllabus",
  "content":"« Previous | Next »\nIntroduction Prerequisites The prerequisite to this course is 18.01 Single Variable Calculus.\nCourse Overview This course covers vector and multi-variable calculus. At MIT it is labeled 18.02 and is the second semester in the MIT freshman calculus sequence. Topics include vectors and matrices, parametric curves, partial derivatives, double and triple integrals, and vector calculus in 2- and 3-space.\nAs its name suggests, multivariable calculus is the extension of calculus to more than one variable. That is, in single variable calculus you study functions of a single independent variable\ny=f(x).\nIn multivariable calculus we study functions of two or more independent variables, e.g.,\nz=f(x, y) or w=f(x, y, z).\nThese functions are interesting in their own right, but they are also essential for describing the physical world.\nMany things depend on more than one independent variable. Here are just a few:\nIn thermodynamics pressure depends on volume and temperature. In electricity and magnetism, the magnetic and electric fields are functions of the three space variables (x,y,z) and one time variable t. In economics, functions can depend on a large number of independent variables, e.g., a manufacturer\u0026rsquo;s cost might depend on the prices of 27 different commodities. In modeling fluid or heat flow the velocity field depends on position and time. Single variable calculus is a highly geometric subject and multivariable calculus is the same, maybe even more so. In your calculus class you studied the graphs of functions y=f(x) and learned to relate derivatives and integrals to these graphs. In this course we will also study graphs and relate them to derivatives and integrals. One key difference is that more variables means more geometric dimensions. This makes visualization of graphs both harder and more rewarding and useful.\nBy the end of the course you will know how to differentiate and integrate functions of several variables. In single variable calculus the Fundamental Theorem of Calculus relates derivatives to integrals. We will see something similar in multivariable calculus and the capstone to the course will be the three theorems (Green\u0026rsquo;s, Stokes\u0026rsquo; and Gauss\u0026rsquo;) that do this.\nCourse Goals After completing this course, students should have developed a clear understanding of the fundamental concepts of multivariable calculus and a range of skills allowing them to work effectively with the concepts.\nThe basic concepts are:\nDerivatives as rates of change, computed as a limit of ratios Integrals as a \u0026lsquo;sum,\u0026rsquo; computed as a limit of Riemann sums The skills include:\nFluency with vector operations, including vector proofs and the ability to translate back and forth among the various ways to describe geometric properties, namely, in pictures, in words, in vector notation, and in coordinate notation. Fluency with matrix algebra, including the ability to put systems of linear equation in matrix format and solve them using matrix multiplication and the matrix inverse. An understanding of a parametric curve as a trajectory described by a position vector; the ability to find parametric equations of a curve and to compute its velocity and acceleration vectors. A comprehensive understanding of the gradient, including its relationship to level curves (or surfaces), directional derivatives, and linear approximation. The ability to compute derivatives using the chain rule or total differentials. The ability to set up and solve optimization problems involving several variables, with or without constraints. An understanding of line integrals for work and flux, surface integrals for flux, general surface integrals and volume integrals. Also, an understanding of the physical interpretation of these integrals. The ability to set up and compute multiple integrals in rectangular, polar, cylindrical and spherical coordinates. The ability to change variables in multiple integrals. An understanding of the major theorems (Green\u0026rsquo;s, Stokes\u0026rsquo;, Gauss\u0026rsquo;) of the course and of some physical applications of these theorems. Course Structure This course, designed for independent study, has been organized to follow the sequence of topics covered in an MIT course on Multivariable Calculus. The content is organized into four major units:\nVectors and Matrices Partial Derivatives Double Integrals and Line Integrals in the Plane Triple Integrals and Surface Integrals in 3-Space Each unit has been further divided into parts (A, B, C, etc.), with each part containing a sequence of sessions. Because each session builds on knowledge from previous sessions, it is important to progress through the sessions in order. Each session covers an amount you might expect to complete in one sitting.\nWithin each unit you will be presented with sets of problems at strategic points, so you can test your understanding of the material. At the end of each unit, there is a comprehensive exam that covers all of the topics you learned in the unit.\nMIT expects its students to spend about 150 hours on this course. More than half of that time is spent preparing for class and doing assignments. It’s difficult to estimate how long it will take you to complete the course, but you can probably expect to spend an hour or more working through each individual session.\nLecture Video Most sessions include video clips from lectures of Professor Denis Auroux teaching 18.02 recorded live on the MIT campus in the fall of 2007. The video was carefully segmented by the developers of this OCW Scholar course to take you step-by-step through the content. The lecture video clips are accompanied by reproductions of the materials presented on chalkboards used during the class.\nRecitation Video This OCW Scholar course includes dozens of Recitation Videos – brief problem solving sessions taught by an experienced MIT Recitation Instructor – developed and recorded especially for you, the independent learner. Meet the recitation instructors and learn more about how to benefit from this help by watching their introductory video.\nViewing videos requires an internet connection View video page Download video Download transcript Readings, Activities and Exams The readings in each session are adapted from materials that have been used for years to teach multivariable calculus at MIT. They provide a slightly different perspective on the material as well as a written record of the topics covered in lecture.\n\u0026ldquo;Examples\u0026rdquo; present problems with their solutions. Take a minute to think about how you would solve each problem before you read the solution. Reading these solutions carefully will prepare you to solve similar problems on your own.\nIn some sessions you will have the opportunity to work with a Mathlet. These interactive learning tools will help you visualize multi-dimensional objects and observe their changes as you manipulate different variables.\n\u0026ldquo;Problems and Solutions\u0026rdquo; let you test your mastery of the content of each session. Solve the problems on your own and check your work against the solutions before proceeding to the next session.\nAt the end of each Part is a Problem Set. As you start each part familiarize yourself with the problems in its problem set; this will enable you to work on each problem as you gain the knowledge you need to solve it. Once you have completed the problem set you can check your answers against the solutions provided. (The problem sets are carefully selected from a longer list of questions available to you. Do not hesitate to work any problem that piques your interest.)\nEach unit ends in an exam. To prepare for an exam first work through the sample exam then check that you are proficient in each of the topics discussed in the exam review lecture. You should also review the solutions to any problems you found difficult in that unit. Allow yourself one hour to work each exam and three hours to complete the final. The exams are quite challenging; do not be surprised if you are unable to answer all of the questions correctly in the time allowed.\nTextbook This OCW Scholar course is self-contained and no textbook is required. If you have access to a multivariable calculus text it will probably serve as a useful companion to this course, although you might have to deal with slight differences in terminology and notation.\nTechnical Requirements This course includes functionality that does not display correctly in Internet Explorer. For best results, we recommend viewing this course with Firefox, Safari or Chrome.\n« Previous | Next »\n"}


